DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
	return( path);
}

bool Event::extractMeFileData(String path, EventFileRef *eventRef)
{
	bool fail = true;

	if(path == NULL)
	{
		return( fail);
	}

	if(!path.startsWith("/"))
	{
		path = "/" + path;
	}

	if(path.endsWith(".event"))
	{
		int dot = path.lastIndexOf(".event");
		path = path.substring(0, dot);
	}

	if(!path.endsWith(".me"))
	{
		path = path + ".me";
	}

	if(SPIFFS.exists(path))
	{
		/* Create an object to hold the file data */
		File file = SPIFFS.open(path, "r"); /* Open the file for reading */

		if(file)
		{
			String s = file.readStringUntil('\n');
			int count = 0;
            int items = 0;

			EventLineData data;

			while(s.length() && (items < 4) && (count++ < MAXIMUM_NUMBER_OF_ME_FILE_LINES))
			{
				Event::extractLineData(s, &data);

				if(data.id.equalsIgnoreCase(TX_DESCRIPTIVE_NAME))
				{
					eventRef->role = data.value;
					fail = false;
                    items++;
				}
				else if(data.id.equalsIgnoreCase(TX_ROLE_FREQ))
				{
					eventRef->freq = data.value;
					fail = false;
                    items++;
				}
                else if(data.id.equalsIgnoreCase(TX_ROLE_POWER))
                {
                    eventRef->power = data.value;
                    fail = false;
                    items++;
                }
				/* ignore TX_ASSIGNMENT "TX_ASSIGNMENT" / *Which role and time slot is assigned to this transmitter: "r:t" * / */

				s = file.readStringUntil('\n');
			}

			file.close();   /* Close the file */
		}
	}
	else
	{
		File file = SPIFFS.open(path, "w"); /* Open the file for writing */

		if(file)
		{
			file.println(TX_ASSIGNMENT + String(",0:0"));
			file.println(String(TX_DESCRIPTIVE_NAME) + ",Finish - MO");
            file.println(String(TX_ROLE_POWER) + ",1000");
			file.println(String(TX_ROLE_FREQ) + ",3550000");
			file.println(TX_ASSIGNMENT_IS_DEFAULT + String(",true"));
			file.close();   /* Close the file */
		}

		eventRef->role = "?";
		eventRef->freq = "?";
		fail = false;
	}

	return( fail);
}

bool Event::readEventFile(String path)
{
	bool failure = false;

	if(!path.startsWith("/"))
	{
		path = "/" + path;
	}

	if(SPIFFS.exists(path))
	{
		this->eventData->tx_assignment = "";
		this->eventData->tx_assignment_is_default = "";
		this->eventData->event_file_version = "";
		this->eventData->event_band = "";
		this->eventData->event_antenna_port = "";
		this->eventData->event_callsign = "";
		this->eventData->event_callsign_speed = "";
		this->eventData->event_start_date_time = "";
		this->eventData->event_finish_date_time = "";
		this->eventData->event_modulation = "";
		this->eventData->event_number_of_tx_types = -1;
		this->myPath = path;

		/* Create an object to hold the file data */
		File file = SPIFFS.open(path, "r"); /* Open the file for reading */

		if(file)
		{
			String s = file.readStringUntil('\n');
			String hold;

			s.trim();
			if(!s.equalsIgnoreCase(String(EVENT_FILE_START)))
			{
				failure = true;
				if(debug_prints_enabled)
				{
					Serial.println(String("Err in 1st line: " + s));
				}
			}
			int count = 0;

			while(s.length() && count++ <= MAXIMUM_NUMBER_OF_EVENT_FILE_LINES)
			{
				hold = s;
				this->parseStringData(s);
				s = file.readStringUntil('\n');
			}

			hold.trim();
			if(!hold.equalsIgnoreCase(String(EVENT_FILE_END)) || (count > MAXIMUM_NUMBER_OF_EVENT_FILE_LINES))
			{
				failure = true;
				if(debug_prints_enabled)
				{
					Serial.println(String("Err in last line: " + hold));
				}
			}

			file.close();   /* Close the file */
		}

		getTxAssignment();

		values_did_change = false;
	}
	else
	{
		return( true);
	}

	if(debug_prints_enabled)
	{
		if(failure)
		{
			Serial.println(String("\tError reading event: ") + path);
		}
		else
		{
			Serial.println(String("\tSuccessfully read event: ") + path);
		}
	}

	return( failure);
}

void Event::dumpData(void)
{
	if(eventData == NULL)
	{
		return;
	}

	Serial.println("=====");
	Serial.println("Event name: " + eventData->event_name);
	Serial.println("File ver: " + eventData->event_file_version);
	Serial.println("Band: " + eventData->event_band);
	Serial.println("Call: " + eventData->event_callsign);
	Serial.println("Start: " + eventData->event_start_date_time);
	Serial.println("Finish: " + eventData->event_finish_date_time);
	Serial.println("Mod: " + eventData->event_modulation);
	Serial.println("Types: " + String(eventData->event_number_of_tx_types));
	for(int i = 0; i < eventData->event_number_of_tx_types; i++)
	{
		Serial.println("  Name: " + eventData->role[i]->rolename);
		Serial.println("    No. txs: " + String(eventData->role[i]->numberOfTxs));
		Serial.println("    Freq: " + String(eventData->role[i]->frequency));
		Serial.println("    Pwr: " + String(eventData->role[i]->powerLevel_mW));
		Serial.println("    WPM: " + String(eventData->role[i]->code_speed));
		Serial.println("    ID int: " + String(eventData->role[i]->id_interval));

		for(int j = 0; j < eventData->role[i]->numberOfTxs; j++)
		{
			Serial.println("      Pattern: " + eventData->role[i]->tx[j]->pattern);
			Serial.println("      onTime: " + eventData->role[i]->tx[j]->onTime);
			Serial.println("      offTime: " + eventData->role[i]->tx[j]->offTime);
			Serial.println("      delayTime: " + eventData->role[i]->tx[j]->delayTime);
		}
	}
	Serial.println("=====");
}

/**
 * Returns TRUE if this event contains valid data
 */
bool Event::validateEvent(void)
{
	bool success;

	success = (this->eventData != NULL);

	if(success)
	{
		success &= (this->eventData->event_name).length() > 0;
		success &= (this->eventData->event_file_version).length() > 0;
		success &= (this->eventData->event_band).length() > 0;
		/*success &= (this->eventData->event_antenna_port); */
		success &= (this->eventData->event_callsign).length() > 2;
		success &= (this->eventData->event_callsign_speed).length() > 0;
		success &= (this->eventData->event_start_date_time).length() > 19;
		success &= (this->eventData->event_finish_date_time).length() > 19;
		success &= (this->eventData->event_modulation).length() > 0;
		success &= ((this->eventData->event_number_of_tx_types) > 0);

