DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
		for(int i = 0; i < this->eventData->event_number_of_tx_types; i++)
		{
			success &= (this->eventData->role[i]->rolename).length() > 0;
			success &= (this->eventData->role[i]->numberOfTxs) > 0;
			success &= (this->eventData->role[i]->frequency) > 0;
			success &= (this->eventData->role[i]->powerLevel_mW) > 0;
			success &= (this->eventData->role[i]->code_speed) > 0;
			/*success &= (this->eventData->role[i]->id_interval); */

			for(int j = 0; j < this->eventData->role[i]->numberOfTxs; j++)
			{
				success &= (this->eventData->role[i]->tx[j]->pattern).length() > 0;
				success &= (this->eventData->role[i]->tx[j]->onTime).length() > 0;
				success &= (this->eventData->role[i]->tx[j]->offTime).length() > 0;
				success &= (this->eventData->role[i]->tx[j]->delayTime).length() > 0;
			}
		}
	}

	return( success);
}

bool Event::writeEventFile(void)
{
	return(this->writeEventFile(this->myPath));
}

bool Event::writeEventFile(String path)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
    
	if(!validateEvent())
	{
		return( true);
	}

	if(this->values_did_change == false)
	{
		if(debug_prints_enabled)
		{
			Serial.print("Not written: Event did not change.");
		}
		Serial.println(path);
		return( false); /*nothing new to save, return no error */
	}
	else if(debug_prints_enabled)
	{
		Serial.print("Writing Event changes to:");
		Serial.println(path);
	}

	if(path == NULL)
	{
		path = this->myPath;
	}

	if(!path.startsWith("/"))
	{
		path = "/" + path;
	}
	/*  if (SPIFFS.exists(path)) {      // version of that file must be deleted (if it exists) */
	/*    SPIFFS.remove(path); */
	/*  } */

	if(debug_prints_enabled)
	{
		Serial.print("Writing file: ");
	}
    
	Serial.println(path);
	File eventFile = SPIFFS.open(path, "w");    /* Open the file for writing in SPIFFS (create if it doesn't exist) */

	this->myPath = path;

	String typenum, txnum;

	if(eventFile)
	{
		eventFile.println(EVENT_FILE_START);
		eventFile.println(String(String(EVENT_NAME) + "," + this->eventData->event_name));
		eventFile.println(String(String(EVENT_FILE_VERSION) + "," + this->eventData->event_file_version));
		eventFile.println(String(String(EVENT_BAND) + "," + this->eventData->event_band));
		eventFile.println(String(String(EVENT_ANTENNA_PORT) + "," + this->eventData->event_antenna_port));
		eventFile.println(String(String(EVENT_CALLSIGN) + "," + this->eventData->event_callsign));
		eventFile.println(String(String(EVENT_CALLSIGN_SPEED) + "," + this->eventData->event_callsign_speed));
		eventFile.println(String(String(EVENT_START_DATE_TIME) + "," + this->eventData->event_start_date_time));
		eventFile.println(String(String(EVENT_FINISH_DATE_TIME) + "," + this->eventData->event_finish_date_time));
		eventFile.println(String(String(EVENT_MODULATION) + "," + this->eventData->event_modulation));
		eventFile.println(String(String(EVENT_NUMBER_OF_TX_TYPES) + "," + this->eventData->event_number_of_tx_types));

		for(int i = 0; i < this->eventData->event_number_of_tx_types; i++)
		{
			typenum = String("TYPE" + String(i + 1));
			eventFile.println(String(typenum + TYPE_NAME + "," + this->eventData->role[i]->rolename));
			eventFile.println(String(typenum + TYPE_TX_COUNT + "," + String(this->eventData->role[i]->numberOfTxs)));
			eventFile.println(String(typenum + TYPE_FREQ + "," + String(this->eventData->role[i]->frequency)));
			eventFile.println(String(typenum + TYPE_POWER_LEVEL + "," + String(this->eventData->role[i]->powerLevel_mW)));
			eventFile.println(String(typenum + TYPE_CODE_SPEED + "," + String(this->eventData->role[i]->code_speed)));
			eventFile.println(String(typenum + TYPE_ID_INTERVAL + "," + String(this->eventData->role[i]->id_interval)));

			for(int j = 0; j < this->eventData->role[i]->numberOfTxs; j++)
			{
				txnum = String("TX" + String(j + 1));
				eventFile.println(String(typenum + "_" + txnum + TYPE_TX_PATTERN + "," + this->eventData->role[i]->tx[j]->pattern));
				eventFile.println(String(typenum + "_" + txnum + TYPE_TX_ON_TIME + "," + this->eventData->role[i]->tx[j]->onTime));
				eventFile.println(String(typenum + "_" + txnum + TYPE_TX_OFF_TIME + "," + this->eventData->role[i]->tx[j]->offTime));
				eventFile.println(String(typenum + "_" + txnum + TYPE_TX_DELAY_TIME + "," + this->eventData->role[i]->tx[j]->delayTime));
			}
		}

		eventFile.println(EVENT_FILE_END);
		eventFile.close();  /* Close the file */
	}
	else
	{
		return( true);
	}

	saveMeData("");

	return( false);
}

void Event::saveMeData(String newAssignment)
{
	if(this->eventData == NULL)
	{
		return;
	}
	if((this->eventData->tx_assignment.length() < 3) || (this->eventData->tx_assignment.indexOf(":") < 1))
	{
		return;
	}
	if(this->myPath.length() < 7)
	{
		return;
	}

	String holdTxAssignment;
	String holdRoleName = this->eventData->tx_role_name;
	String holdRoleFrequency = this->eventData->tx_role_freq;

	if(newAssignment.indexOf(":") < 1)
	{
		holdTxAssignment = this->eventData->tx_assignment;
	}
	else
	{
		holdTxAssignment = newAssignment;
	}

	String path = readMeFile(this->myPath); /* assigns file value to this->eventData->tx_assignment */

	if((!holdTxAssignment.equals(this->eventData->tx_assignment)) || (!holdRoleName.equals(this->eventData->tx_role_name)) || (!holdRoleFrequency.equals(this->eventData->tx_role_freq)))
	{
		String role = holdTxAssignment.substring(0, holdTxAssignment.indexOf(":"));
		File file = SPIFFS.open(path, "w"); /* Open the file for writing */

		if(file)
		{
			file.println(EVENT_FILE_START);
			file.println(String(TX_ASSIGNMENT) + "," + holdTxAssignment);
			file.println(String(TX_DESCRIPTIVE_NAME) + "," + getTxDescriptiveName(holdTxAssignment));
            file.println(String(TX_ROLE_POWER) + "," + String(this->getPowerlevelForRole(role.toInt())));
			file.println(String(TX_ROLE_FREQ) + "," + String(this->getFrequencyForRole(role.toInt())));
			file.println(String(TX_ASSIGNMENT_IS_DEFAULT) + ",false");
			file.println(EVENT_FILE_END);
			file.close();   /* Close the file */

			if(debug_prints_enabled)
			{
				Serial.println(String("\tWrote file: ") + path);
			}
		}
	}

