DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
	this->eventData->tx_assignment = holdTxAssignment;  /* set tx_assignment to the latest value */
}

/*/////////////////////////////////////////////////////////////////////////////////////// */

bool Event::setTxAssignment(String role_slot)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	role_slot.trim();
	int c = role_slot.indexOf(':');
	if(c < 1)
	{
		return( true);
	}

	if(this->eventData->tx_assignment != role_slot)
	{
		String r = role_slot.substring(0, c - 1);
		this->eventData->tx_assignment = role_slot;
		this->eventData->tx_role_name = Event::getTxDescriptiveName(role_slot);
        this->eventData->tx_role_pwr = Event::getPowerlevelForRole(r.toInt());
		this->eventData->tx_role_freq = Event::getFrequencyForRole(r.toInt());
		this->values_did_change = true;
		Serial.println("Set role: " + this->eventData->tx_assignment);
	}

	return( false);
}

String Event::getTxAssignment(void)
{
	if((this->eventData->tx_assignment.length() < 1) || (this->eventData->tx_assignment.indexOf(":") < 1))
	{
		Serial.println("Reading ME file...");
		readMeFile(this->myPath);
	}

	return( this->eventData->tx_assignment);
}

bool Event::setTxFrequency(String frequency)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(frequency == NULL)
	{
		return( true);
	}

	if(!frequency.equals(this->eventData->tx_role_freq))
	{
		this->eventData->tx_role_freq = frequency;
		this->values_did_change = true;
		Serial.println("Set frequency: " + this->eventData->tx_role_freq);
	}

	return( false);
}

String Event::getTxFrequency(void)
{
	if((this->eventData->tx_assignment.length() < 1) || (this->eventData->tx_assignment.indexOf(":") < 1))
	{
		Serial.println("Reading ME file...");
		readMeFile(this->myPath);
	}

	return( this->eventData->tx_role_freq);
}

int Event::getTxRoleIndex(void)
{
	int result = -1;
	String assign = this->eventData->tx_assignment;

	if(assign.indexOf(":") < 1)
	{
		getTxAssignment();
	}
	int colon = assign.indexOf(":");
	if(colon < 1)
	{
		return( result);
	}
	result = (assign.substring(0, colon)).toInt();  /* r */
	return( result);
}

int Event::getTxSlotIndex(void)
{
	int result = -1;
	String assign = this->eventData->tx_assignment;

	if(assign.indexOf(":") < 1)
	{
		getTxAssignment();
	}
	int colon = assign.indexOf(":");
	if(colon < 1)
	{
		return( result);
	}
	result = (assign.substring(colon + 1)).toInt(); /* t */
	return( result);
}

TxDataType *Event::getTxData(int roleIndex, int txIndex)
{
	return( eventData->role[roleIndex]->tx[txIndex]);
}

void Event::setEventName(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_name != str)
	{
		this->setEventData(EVENT_NAME, str);
		this->values_did_change = true;
	}
}

String Event::getEventName(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_name);
}

void Event::setEventFileVersion(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_file_version != str)
	{
		this->setEventData(EVENT_FILE_VERSION, str);
		this->values_did_change = true;
	}
}

String Event::getEventFileVersion(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_file_version);
}

void Event::setEventBand(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_band != str)
	{
		this->setEventData(EVENT_BAND, str);
		this->values_did_change = true;
	}
}

String Event::getEventBand(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_band);
}

void Event::setCallsign(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_callsign != str)
	{
		this->setEventData(EVENT_CALLSIGN, str);
		this->values_did_change = true;
	}
}

String Event::getCallsign(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_callsign);
}

void Event::setAntennaPort(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_antenna_port != str)
	{
		this->setEventData(EVENT_ANTENNA_PORT, str);
		this->values_did_change = true;
	}
}

String Event::getAntennaPort(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_antenna_port);
}

void Event::setCallsignSpeed(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_callsign_speed != str)
	{
		this->setEventData(EVENT_CALLSIGN_SPEED, str);
		this->values_did_change = true;
	}
}

String Event::getCallsignSpeed(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_callsign_speed);
}

void Event::setEventStartDateTime(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	/* Lop off milliseconds if they exist */
	if((str.length() > 20) && (str.lastIndexOf('.') > 0))
	{
		int index = str.lastIndexOf('.');
		str = str.substring(0, index);
		str = str + "Z";
	}

	/* Add seconds if they are missing */
	if(str.lastIndexOf(':') == str.indexOf(':'))    /* if time contains only one ':' */
	{
		int index = str.lastIndexOf(':') + 3;
		str = str.substring(0, index);
		str = str + ":00Z";
	}

	if(!(this->eventData->event_start_date_time.equals(str)))
	{
		this->setEventData(EVENT_START_DATE_TIME, str);
		this->values_did_change = true;
		/*    Serial.println("setEventStartDateTime: str = " + str); */
	}
}

String Event::getEventStartDateTime(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_start_date_time);
}

void Event::setEventFinishDateTime(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	/* Lop off milliseconds if they exist */
	if((str.length() > 20) && (str.lastIndexOf('.') > 0))
	{
		int index = str.lastIndexOf('.');
		str = str.substring(0, index);
		str = str + "Z";
	}

	/* Add seconds if they are missing */
	if(str.lastIndexOf(':') == str.indexOf(':'))    /* if time contains only one ':' */
	{
		int index = str.lastIndexOf(':') + 3;
		str = str.substring(0, index);
		str = str + ":00Z";
	}

	if(!(this->eventData->event_finish_date_time.equals(str)))
	{
		this->setEventData(EVENT_FINISH_DATE_TIME, str);
		this->values_did_change = true;
	}
}

String Event::getEventFinishDateTime(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_finish_date_time);
}

void Event::setEventModulation(String str)
{
	if(this->eventData == NULL)
	{
		return;
	}
	str.trim();

	if(this->eventData->event_modulation != str)
	{
		this->setEventData(EVENT_MODULATION, str);
		this->values_did_change = true;
	}
}

String Event::getEventModulation(void) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	return( this->eventData->event_modulation);
}

void Event::setEventNumberOfTxTypes(int val)
{
	if(this->eventData == NULL)
	{
		return;
	}

	if(this->eventData->event_number_of_tx_types != val)
	{
		this->setEventData(EVENT_NUMBER_OF_TX_TYPES, val);
		this->values_did_change = true;
	}
}

void Event::setEventNumberOfTxTypes(String str)
{
	this->setEventNumberOfTxTypes(str.toInt());
	this->values_did_change = true;
}

int Event::getEventNumberOfTxTypes(void) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	return( this->eventData->event_number_of_tx_types);
}

bool Event::setRolename(int roleIndex, String str)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}
	this->eventData->role[roleIndex]->rolename = str;
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " role: " + str); */
	this->values_did_change = true;
	return( false);
}

String Event::getRolename(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( "");
	}
	if(roleIndex < 0)
	{
		return( "");
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( "");
	}
	return( this->eventData->role[roleIndex]->rolename);
}

bool Event::setNumberOfTxsForRole(int roleIndex, String str)
{
	int num = str.toInt();

	if(num < 1)
	{
		return( true);
	}
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}

	this->eventData->role[roleIndex]->numberOfTxs = num;
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " No Txs: " + str); */
	this->values_did_change = true;
	return( false);
}

