DigitalConfections/Receiver-Development-Platform/ESP8266/ARDF_Transmitter/ARDF_Transmitter/Event.cpp
int Event::getNumberOfTxsForRole(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	if(roleIndex < 0)
	{
		return( -1);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( -1);
	}
	return( this->eventData->role[roleIndex]->numberOfTxs);
}

bool Event::setFrequencyForRole(int roleIndex, long freq)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}
	this->eventData->role[roleIndex]->frequency = freq;
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " freq: " + String(freq)); */
	this->values_did_change = true;

	/*If the transmitter is currently set to this role then update its frequency too */
	if(roleIndex == this->getTxRoleIndex())
	{
		this->setTxFrequency(String(freq));
	}
	return( false);
}

long Event::getFrequencyForRole(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	if(roleIndex < 0)
	{
		return( -1);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( -1);
	}
	return( this->eventData->role[roleIndex]->frequency);
}

bool Event::setPowerlevelForRole(int roleIndex, String str)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}
	this->eventData->role[roleIndex]->powerLevel_mW = str.toInt();
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " freq: " + str); */
	this->values_did_change = true;
	return( false);
}

int Event::getPowerlevelForRole(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	if(roleIndex < 0)
	{
		return( -1);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( -1);
	}
	return( this->eventData->role[roleIndex]->powerLevel_mW);
}

bool Event::setCodeSpeedForRole(int roleIndex, String str)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}
	this->eventData->role[roleIndex]->code_speed = str.toInt();
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " freq: " + str); */
	this->values_did_change = true;
	return( false);
}

int Event::getCodeSpeedForRole(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	if(roleIndex < 0)
	{
		return( -1);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( -1);
	}
	return( this->eventData->role[roleIndex]->code_speed);
}

bool Event::setIDIntervalForRole(int roleIndex, String str)
{
	if(this->eventData == NULL)
	{
		return( true);
	}
	if(roleIndex < 0)
	{
		return( true);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( true);
	}
	this->eventData->role[roleIndex]->id_interval = str.toInt();
	/*  if (debug_prints_enabled) Serial.println("Type" + String(roleIndex) + " freq: " + str); */
	this->values_did_change = true;
	return( false);
}

int Event::getIDIntervalForRole(int roleIndex) const
{
	if(this->eventData == NULL)
	{
		return( -1);
	}
	if(roleIndex < 0)
	{
		return( -1);
	}
	if(roleIndex >= this->eventData->event_number_of_tx_types)
	{
		return( -1);
	}
	return( this->eventData->role[roleIndex]->id_interval);
}

/*/////////////////////////////////////////////////////////////////////////////////// */

bool Event::setEventData(String id, int value)
{
	return( this->setEventData(id, String(value)));
}

bool Event::setEventData(String id, String value)
{
	bool result = false;
	static String typeIndexStr = "";
	static int typeIndex = 0;
	static String txIndexStr = "";
	static int txIndex = 0;

	if(id.equalsIgnoreCase(TX_ASSIGNMENT))
	{
		/*    if (debug_prints_enabled) Serial.println("Tx assignment: " + value); */
		this->eventData->tx_assignment = value;
	}
	else if(id.equalsIgnoreCase(TX_DESCRIPTIVE_NAME))
	{
		this->eventData->tx_role_name = value;
	}
    else if(id.equalsIgnoreCase(TX_ROLE_POWER))
    {
        this->eventData->tx_role_pwr = value;
    }
	else if(id.equalsIgnoreCase(TX_ROLE_FREQ))
	{
		this->eventData->tx_role_freq = value;
	}
	else if(id.equalsIgnoreCase(TX_ASSIGNMENT_IS_DEFAULT))
	{
		/*    if (debug_prints_enabled) Serial.println("Tx is default: " + value); */
		if(value.equalsIgnoreCase("TRUE") || value.equals("1"))
		{
			this->eventData->tx_assignment_is_default = true;
		}
		else
		{
			this->eventData->tx_assignment_is_default = false;
		}
	}
	else if(id.equalsIgnoreCase(EVENT_NAME))
	{
		/*    if (debug_prints_enabled) Serial.println("Event name: " + value); */
		this->eventData->event_name = value;
	}
	else if(id.equalsIgnoreCase(EVENT_FILE_VERSION))
	{
		/*    if (debug_prints_enabled) Serial.println("File ver: " + value); */
		this->eventData->event_file_version = value;
	}
	else if(id.equalsIgnoreCase(EVENT_BAND))
	{
		/*    if (debug_prints_enabled) Serial.println("Event band: " + value); */
		this->eventData->event_band = value;
	}
	else if(id.equalsIgnoreCase(EVENT_CALLSIGN))
	{
		/*    if (debug_prints_enabled) Serial.println("Event callsign: " + value); */
		this->eventData->event_callsign = value;
	}
	else if(id.equalsIgnoreCase(EVENT_ANTENNA_PORT))
	{
		/*    if (debug_prints_enabled) Serial.println("Event antenna: " + value); */
		this->eventData->event_antenna_port = value;
	}
	else if(id.equalsIgnoreCase(EVENT_CALLSIGN_SPEED))
	{
		/*    if (debug_prints_enabled) Serial.println("Event ID speed: " + value); */
		this->eventData->event_callsign_speed = value;
	}
	else if(id.equalsIgnoreCase(EVENT_START_DATE_TIME))
	{
		/*    if (debug_prints_enabled) Serial.println("Event start: " + value); */
		this->eventData->event_start_date_time = value;
	}
	else if(id.equalsIgnoreCase(EVENT_FINISH_DATE_TIME))
	{
		/*    if (debug_prints_enabled) Serial.println("Event finish: " + value); */
		this->eventData->event_finish_date_time = value;
	}
	else if(id.equalsIgnoreCase(EVENT_MODULATION))
	{
		/*    if (debug_prints_enabled) Serial.println("Event modulation: " + value); */
		this->eventData->event_modulation = value;
	}
	else if(id.equalsIgnoreCase(EVENT_NUMBER_OF_TX_TYPES))
	{
		/*    if (debug_prints_enabled) Serial.println("Event tx types: " + value); */
		this->eventData->event_number_of_tx_types = value.toInt();
	}
	else if(id.endsWith(TYPE_TX_COUNT))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->numberOfTxs = value.toInt();
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " count: " + value); */
		}
	}
	else if(id.endsWith(TYPE_NAME))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->rolename = value;
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " role: " + value); */
		}
	}
	else if(id.endsWith(TYPE_FREQ))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->frequency = value.toInt();
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " freq: " + value); */
		}
	}
	else if(id.endsWith(TYPE_POWER_LEVEL))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->powerLevel_mW = value.toInt();
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " power: " + value + " mW"); */
		}
	}
	else if(id.endsWith(TYPE_ID_INTERVAL))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->id_interval = value.toInt();
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " ID interval: " + value + " sec"); */
		}
	}
	else if(id.endsWith(TYPE_CODE_SPEED))
	{
		typeIndexStr = id.substring((id.indexOf("TYPE") + 4), id.indexOf("_"));
		typeIndex = typeIndexStr.toInt() - 1;
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			this->eventData->role[typeIndex]->code_speed = value.toInt();
			/*      if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + " code speed: " + value + " WPM"); */
		}
	}
	else if(id.endsWith(TYPE_TX_PATTERN))
	{
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			int i = id.indexOf("TX") + 2;
			txIndexStr = id.substring(i, id.indexOf("_", i));
			txIndex = txIndexStr.toInt() - 1;

			if((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
			{
				this->eventData->role[typeIndex]->tx[txIndex]->pattern = value;
				/*        if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " pattern: " + value); */
			}
		}
	}
	else if(id.endsWith(TYPE_TX_ON_TIME))
	{
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			int i = id.indexOf("TX") + 2;
			txIndexStr = id.substring(i, id.indexOf("_", i));
			txIndex = txIndexStr.toInt() - 1;

			if((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
			{
				this->eventData->role[typeIndex]->tx[txIndex]->onTime = value;
				/*        if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " on time: " + value + "sec"); */
			}
		}
	}
	else if(id.endsWith(TYPE_TX_OFF_TIME))
	{
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			int i = id.indexOf("TX") + 2;
			txIndexStr = id.substring(i, id.indexOf("_", i));
			txIndex = txIndexStr.toInt() - 1;

			if((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
			{
				this->eventData->role[typeIndex]->tx[txIndex]->offTime = value.toInt();
				/*        if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " off time: " + value + "sec"); */
			}
		}
	}
	else if(id.endsWith(TYPE_TX_DELAY_TIME))
	{
		if((typeIndex >= 0) && (typeIndex < MAXIMUM_NUMBER_OF_EVENT_TX_TYPES))
		{
			int i = id.indexOf("TX") + 2;
			txIndexStr = id.substring(i, id.indexOf("_", i));
			txIndex = txIndexStr.toInt() - 1;

			if((txIndex >= 0) && (txIndex < MAXIMUM_NUMBER_OF_TXs_OF_A_TYPE))
			{
				this->eventData->role[typeIndex]->tx[txIndex]->delayTime = value;
				/*        if (debug_prints_enabled) Serial.println("Type" + typeIndexStr + "Tx" + txIndexStr + " delay time: " + value + "sec"); */
			}
		}
	}
	else
	{
		if(debug_prints_enabled)
		{
			Serial.println("Error in file: SettingID = " + id + " Value =[" + value + "]");
		}

		result = true;
	}

	return( result);
}